
Функция СведенияОВнешнейОбработке() Экспорт
    
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Наименование = Метаданные().Синоним;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "1.5";
	ПараметрыРегистрации.Информация = Метаданные().Комментарий;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = Метаданные().Имя;
	Команда.Представление = Метаданные().Синоним;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;

КонецФункции
